src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтарыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НазначенияИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НазначенияИсполнителей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Кого назначили</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Назначил</Name>
					<Comment>Кто выполнил назначение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Пояснение к событию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Comment>Для какой заявки</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКомментариев</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебнаяЗаметка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРеакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРешения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеSLA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетЗакрытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяРаботаСОборудованием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаСОборудованиемЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>Фамилия сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Comment>Почта сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Контактный телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Comment>Можно ли использовать сотрудника в системе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетБытьИсполнителем</Name>
					<Comment>Можно ли назначать сотрудника исполнителем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяРуководителемIT</Name>
					<Comment>Может ли контролировать SLA и назначать исполнителей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОборудование</Name>
					<Comment>Может ли вести оборудование</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ITЗаявка/Ext/ObjectModule.bsl
Перем ПредыдущийСтатус;
Перем СохраненныеДанныеЗаявки; 
Перем ТекущийСотрудник;

Процедура УстановитьНачальныйСтатус()
	Если Не ЗначениеЗаполнено(ТекущийСтатус) Тогда
		ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗаявителяПоТекущемуПользователю()
	Если ЗначениеЗаполнено(Заявитель) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();	
	Исключение
	 	Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
		Возврат; 
	КонецПопытки; 
	
	Если ТекущийСотрудник <> Неопределено Тогда
		Заявитель = ТекущийСотрудник; 	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
 	УстановитьНачальныйСтатус();
	УстановитьЗаявителяПоТекущемуПользователю();
КонецПроцедуры 

Функция СтатусТребуетИсполнителя()
	Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая ИЛИ ТекущийСтатус =  Перечисления.СтатусыЗаявок.Отменена Тогда
		Возврат Ложь;	
	КонецЕсли;
	Возврат Истина;
КонецФункции  

Процедура ПроверитьИсполнителя(Отказ)
	Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая И ЗначениеЗаполнено(Исполнитель)Тогда
		Сообщить("Для новой заявки исполнитель не должен быть заполнен.");
		Отказ = Истина; 
		Возврат;
	КонецЕсли; 	  

	Если СтатусТребуетИсполнителя() И НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Сообщить("Не заполнен исполнитель.");		
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
    	Возврат;
	КонецЕсли;
	
	Если Исполнитель.Активен = ЛОЖЬ Тогда
		Сообщить("Выбранный сотрудник неактивен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Исполнитель.МожетБытьИсполнителем = ЛОЖЬ Тогда
		Сообщить("Выбранный сотрудник не может быть исполнителем заявок.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция СтатусТребуетРезультатВыполнения()
	Возврат ТекущийСтатус = Перечисления.СтатусыЗаявок.Решена ИЛИ ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта;	
КонецФункции

Процедура ПроверитьЗаполнениеЗаявки(Отказ)
	Если Не ЗначениеЗаполнено(Заявитель) Тогда
		Сообщить("Не заполнен заявитель.");
		Отказ = Истина;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Сообщить("Не заполнена категория.");		
		Отказ = Истина;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Приоритет) Тогда
		Сообщить("Не заполнен приоритет.");
		Отказ = Истина;	
	КонецЕсли;     
	
	Если Не ЗначениеЗаполнено(ОписаниеПроблемы) Тогда
		Сообщить("Не заполнено описание проблемы.");
		Отказ = Истина;	
	КонецЕсли;
	
	Если КатегорияТребуетОборудование() Тогда

		Если НЕ ЗначениеЗаполнено(Оборудование) Тогда
			Сообщить("Для выбранной категории необходимо указать оборудование.");
			Отказ = Истина;

		Иначе
			ТекущееСостояниеОборудования = УправлениеОборудованиемСервер.ПолучитьТекущееСостояниеОборудования(Оборудование, ТекущаяДатаСеанса());

			Если ТекущееСостояниеОборудования = Неопределено Тогда
				Сообщить("Не удалось определить состояние оборудования.");
				Отказ = Истина;

			ИначеЕсли ТекущееСостояниеОборудования.Состояние <>
					Перечисления.СостоянияОборудования.Используется Тогда

				Сообщить("В заявке можно указать только оборудование, находящееся в использовании.");
				Отказ = Истина;

			ИначеЕсли ТекущееСостояниеОборудования.ЗакрепленоЗа <> Заявитель Тогда
				Сообщить("В заявке можно указать только оборудование, закреплённое за заявителем.");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	ПроверитьИсполнителя(Отказ); 
	
	Если СтатусТребуетРезультатВыполнения() И НЕ ЗначениеЗаполнено(РезультатВыполнения) Тогда
		Сообщить("Не заполнен результат выполнения.");
		Отказ = Истина;		
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьСрокиSLA(Отказ)
	ПравилоSLA = УправлениеSLAСервер.ПолучитьПравилоSLA(Приоритет, Дата);
	Если ПравилоSLA = Неопределено Тогда 
		Сообщить("Для данного приоритета и даты норматив не найден");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	Если ПравилоSLA.СрокРеакцииЧасы > 0 И ПравилоSLA.СрокРешенияЧасы > 0 Тогда
		СрокРеакции = Дата + ПравилоSLA.СрокРеакцииЧасы * 3600;
		СрокРешения = Дата + ПравилоSLA.СрокРешенияЧасы * 3600;
	Иначе
		Отказ = Истина;
		Сообщить("Нормативы SLA должны быть больше нуля.");
	КонецЕсли;
КонецПроцедуры

Функция МожноПересчитыватьSLA()
	Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая ИЛИ ТекущийСтатус = Перечисления.СтатусыЗаявок.Назначена Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции  

Функция ПолучитьСохраненныеДанныеЗаявки()
	
	Если ЭтоНовый() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ITЗаявка.Номер КАК Номер,
		|	ITЗаявка.Дата КАК Дата,
		|	ITЗаявка.ТекущийСтатус КАК ТекущийСтатус,
		|	ITЗаявка.Заявитель КАК Заявитель,
		|	ITЗаявка.Категория КАК Категория,
		|	ITЗаявка.Приоритет КАК Приоритет,
		|	ITЗаявка.ОписаниеПроблемы КАК ОписаниеПроблемы,
		|	ITЗаявка.Оборудование КАК Оборудование,
		|	ITЗаявка.Исполнитель КАК Исполнитель,
		|	ITЗаявка.СрокРеакции КАК СрокРеакции,
		|	ITЗаявка.СрокРешения КАК СрокРешения,
		|	ITЗаявка.ДатаРеакции КАК ДатаРеакции,
		|	ITЗаявка.ДатаРешения КАК ДатаРешения,
		|	ITЗаявка.ДатаЗакрытия КАК ДатаЗакрытия,
		|	ITЗаявка.РезультатВыполнения КАК РезультатВыполнения
		|ИЗ
		|	Документ.ITЗаявка КАК ITЗаявка
		|ГДЕ
		|	ITЗаявка.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("Номер", Выборка.Номер);
	ДанныеЗаявки.Вставить("Дата", Выборка.Дата);
	ДанныеЗаявки.Вставить("ТекущийСтатус", Выборка.ТекущийСтатус);
	ДанныеЗаявки.Вставить("Заявитель", Выборка.Заявитель);
	ДанныеЗаявки.Вставить("Категория", Выборка.Категория);
	ДанныеЗаявки.Вставить("Приоритет", Выборка.Приоритет);
	ДанныеЗаявки.Вставить("ОписаниеПроблемы", Выборка.ОписаниеПроблемы);
	ДанныеЗаявки.Вставить("Оборудование", Выборка.Оборудование);
	ДанныеЗаявки.Вставить("Исполнитель", Выборка.Исполнитель);
	ДанныеЗаявки.Вставить("СрокРеакции", Выборка.СрокРеакции);
	ДанныеЗаявки.Вставить("СрокРешения", Выборка.СрокРешения);
	ДанныеЗаявки.Вставить("ДатаРеакции", Выборка.ДатаРеакции);
	ДанныеЗаявки.Вставить("ДатаРешения", Выборка.ДатаРешения);
	ДанныеЗаявки.Вставить("ДатаЗакрытия", Выборка.ДатаЗакрытия);
	ДанныеЗаявки.Вставить("РезультатВыполнения", Выборка.РезультатВыполнения);

	Возврат ДанныеЗаявки;

КонецФункции

Функция ПереходСтатусаРазрешен(СтарыйСтатус, НовыйСтатус)
	Если СтарыйСтатус = НовыйСтатус Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтарыйСтатус) Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.Новая;
	КонецЕсли;

	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Новая Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.Назначена
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена;
	КонецЕсли;

	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Назначена Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена;
	КонецЕсли; 
		
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения 
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Решена
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена;
	КонецЕсли;
		
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена;
	КонецЕсли;
		
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена;
	КонецЕсли;
	
    Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.Закрыта
			ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

Функция ПользовательМожетВыполнитьПереход(СтарыйСтатус, НовыйСтатус)
	Если СтарыйСтатус = НовыйСтатус Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтарыйСтатус) Тогда
		Возврат НовыйСтатус = Перечисления.СтатусыЗаявок.Новая;
	КонецЕсли; 
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РольДоступна("РуководительITОтдела") Тогда

		Если НовыйСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
			Возврат Истина;
		КонецЕсли;

		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Новая
			И НовыйСтатус = Перечисления.СтатусыЗаявок.Назначена Тогда
			Возврат Истина;
		КонецЕсли;

		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Решена
			И (НовыйСтатус = Перечисления.СтатусыЗаявок.Закрыта
				ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;    
	
	Если РольДоступна("ОтветственныйЗаОборудование") И ТекущийСотрудник <> Неопределено И ТекущийСотрудник.ОтветственныйЗаОборудование Тогда
		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование
			И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда	
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РольДоступна("ИсполнительЗаявок") Тогда 
		Если ТекущийСотрудник = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Если ТекущийСотрудник <> Исполнитель Тогда
			Возврат Ложь;
		КонецЕсли;
		
    	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Назначена
			И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Возврат Истина;
		КонецЕсли;

		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе
			И (НовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения
				ИЛИ НовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения
			И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Возврат Истина;
		КонецЕсли; 
		
		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование
			И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе
			И НовыйСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Процедура ПроверитьПереходСтатуса(Отказ)
	Если Не ПереходСтатусаРазрешен(ПредыдущийСтатус, ТекущийСтатус) Тогда
		Сообщить("Переход из """ + Строка(ПредыдущийСтатус)
			+ """ в """ + Строка(ТекущийСтатус) + """ запрещён.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование
		И ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		ОперацияЗавершена = УправлениеОборудованиемСервер.ЕстьЗавершеннаяОперацияПоОборудованию(Ссылка);

		Если НЕ ОперацияЗавершена Тогда
			Сообщить("Нельзя вернуть заявку в работу: оборудование ещё не выдано или ремонт не завершён.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	Если Не ПользовательМожетВыполнитьПереход(
		ПредыдущийСтатус, ТекущийСтатус) Тогда
		Сообщить("У пользователя недостаточно прав для перехода из """
			+ Строка(ПредыдущийСтатус) + """ в """
			+ Строка(ТекущийСтатус) + """.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбновитьФактическиеДаты()
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Назначена И ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		Если Не ЗначениеЗаполнено(ДатаРеакции) Тогда
			ДатаРеакции = ТекущаяДатаСеанса();
		КонецЕсли;		
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе И ТекущийСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
		ДатаРешения = ТекущаяДатаСеанса();		
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Решена И ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		ДатаРешения = Дата(1, 1, 1);		
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Решена И ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта Тогда
		ДатаЗакрытия = ТекущаяДатаСеанса();		
	КонецЕсли;
КонецПроцедуры 

Процедура ПроверитьИзменениеДанныхЗаявки(Отказ)
	Если СохраненныеДанныеЗаявки = Неопределено Тогда
    	Возврат;
	КонецЕсли;   
	
	ИзмененыСистемныеДанные = Номер <> СохраненныеДанныеЗаявки.Номер 
		ИЛИ Дата <> СохраненныеДанныеЗаявки.Дата
		ИЛИ Заявитель <> СохраненныеДанныеЗаявки.Заявитель
		ИЛИ СрокРеакции <> СохраненныеДанныеЗаявки.СрокРеакции 
	    ИЛИ СрокРешения <> СохраненныеДанныеЗаявки.СрокРешения 
        ИЛИ ДатаРеакции <> СохраненныеДанныеЗаявки.ДатаРеакции 
        ИЛИ ДатаРешения <> СохраненныеДанныеЗаявки.ДатаРешения
		ИЛИ ДатаЗакрытия <> СохраненныеДанныеЗаявки.ДатаЗакрытия;
		
	Если ИзмененыСистемныеДанные = Истина Тогда
		Сообщить("Номер, дату, заявителя и рассчитанные даты нельзя изменять вручную.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
		
	ИзмененоОписание = ОписаниеПроблемы <> СохраненныеДанныеЗаявки.ОписаниеПроблемы;

	ИзмененаКлассификация = Категория <> СохраненныеДанныеЗаявки.Категория
		ИЛИ Приоритет <> СохраненныеДанныеЗаявки.Приоритет
		ИЛИ Оборудование <> СохраненныеДанныеЗаявки.Оборудование;

	ИзмененИсполнитель = Исполнитель <> СохраненныеДанныеЗаявки.Исполнитель;
	
	ИзмененРезультат = РезультатВыполнения <> СохраненныеДанныеЗаявки.РезультатВыполнения;
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененоОписание Тогда
		Сообщить("Для существующей заявки описание может исправлять только администратор.");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	МожноИзменятьКлассификациюИНазначение = РольДоступна("РуководительITОтдела")
	И (СохраненныеДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая
		ИЛИ СохраненныеДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.Назначена);

	Если (ИзмененаКлассификация ИЛИ ИзмененИсполнитель)
		И НЕ МожноИзменятьКлассификациюИНазначение Тогда
		Сообщить("Изменять категорию, приоритет, оборудование и исполнителя может руководитель только в статусах «Новая» и «Назначена».");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МожноИзменятьРезультат = РольДоступна("ИсполнительЗаявок")
		И ТекущийСотрудник <> Неопределено 
		И ТекущийСотрудник = СохраненныеДанныеЗаявки.Исполнитель
		И СохраненныеДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе;
		
	Если ИзмененРезультат и НЕ МожноИзменятьРезультат Тогда	
		Сообщить("Результат выполнения может изменять только назначенный исполнитель во время работы над заявкой.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры  

Процедура ОпределитьТекущегоСотрудника(Отказ)
	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();	
	Исключение
	 	Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;	
	
	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Отказ = Истина; 	
	КонецЕсли;
КонецПроцедуры 

Функция ПолучитьОбязательныйТипКомментарияДляПерехода(СтарыйСтатус, НовыйСтатус)    
	НеобходимыйТипКомментария = Перечисления.ТипыКомментариев.ПустаяСсылка();
	
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе И НовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения Тогда
		НеобходимыйТипКомментария = Перечисления.ТипыКомментариев.ЗапросУточнения;
		Возврат НеобходимыйТипКомментария;
	КонецЕсли; 
	
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НеобходимыйТипКомментария = Перечисления.ТипыКомментариев.ОтветСотрудника;  
		Возврат НеобходимыйТипКомментария;
	КонецЕсли;
	
	Если СтарыйСтатус = Перечисления.СтатусыЗаявок.Решена И НовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		НеобходимыйТипКомментария = Перечисления.ТипыКомментариев.ПричинаВозврата;  
		Возврат НеобходимыйТипКомментария;
	КонецЕсли; 
	
	Возврат НеобходимыйТипКомментария;
КонецФункции

Процедура ПроверитьКомментарийДляПерехода(Отказ)
	Если СохраненныеДанныеЗаявки = Неопределено ИЛИ ПредыдущийСтатус = ТекущийСтатус Тогда
		Возврат;  
	КонецЕсли;
	
	НеобходимыйТипКомментария = ПолучитьОбязательныйТипКомментарияДляПерехода(ПредыдущийСтатус, ТекущийСтатус);
	Если НЕ ЗначениеЗаполнено(НеобходимыйТипКомментария) Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		КомментарийНайден = УправлениеКомментариямиСервер.ЕстьАктуальныйКомментарийДляПерехода(Ссылка, ПредыдущийСтатус, НеобходимыйТипКомментария);
	
	Исключение
		Сообщить("Не удалось проверить комментарий для изменения статуса. " + ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если НЕ КомментарийНайден Тогда
		Сообщить("Для изменения статуса необходимо добавить комментарий типа: " + Строка(НеобходимыйТипКомментария) + ".");	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьИсполнителяПриОтмене()

	Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена И ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	УстановитьНачальныйСтатус();     
	
	ОпределитьТекущегоСотрудника(Отказ);
	Если Отказ = Истина Тогда
		Возврат;  
	КонецЕсли;
	
	СохраненныеДанныеЗаявки = ПолучитьСохраненныеДанныеЗаявки(); 
	Если СохраненныеДанныеЗаявки = Неопределено И НЕ ЭтоНовый() Тогда
		Сообщить("Не удалось получить сохранённые данные заявки. Запись отменена.");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если СохраненныеДанныеЗаявки = Неопределено Тогда
		ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ПустаяСсылка();
	Иначе
		ПредыдущийСтатус = СохраненныеДанныеЗаявки.ТекущийСтатус;
	КонецЕсли;
	
	ПроверитьИзменениеДанныхЗаявки(Отказ);
	Если Отказ = Истина Тогда
		Возврат;  
	КонецЕсли;
	
	ПроверитьПереходСтатуса(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПроверитьКомментарийДляПерехода(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ОчиститьИсполнителяПриОтмене();
	
	ПроверитьЗаполнениеЗаявки(Отказ);
	Если Отказ = Истина Тогда
		Возврат;  
	КонецЕсли;
	
	Если МожноПересчитыватьSLA() Тогда 
		РассчитатьСрокиSLA(Отказ);	
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;  
	КонецЕсли;
	ОбновитьФактическиеДаты();
КонецПроцедуры 

Функция КатегорияТребуетОборудование()
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат Ложь;
	Иначе	
	    Возврат Категория.ТребуетОборудование;
	КонецЕсли;
КонецФункции  

Процедура ЗаписатьИсториюИзмененияСтатуса(Отказ, МоментИзменения)
	Попытка	 
		НоваяЗапись = РегистрыСведений.ИсторияИзмененияСтатусов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = МоментИзменения;
		НоваяЗапись.Заявка = Ссылка;
		НоваяЗапись.СтарыйСтатус = ПредыдущийСтатус;
		НоваяЗапись.НовыйСтатус = ТекущийСтатус;
		НоваяЗапись.Пользователь = ТекущийСотрудник;
	
		НоваяЗапись.Записать();
	Исключение
		Отказ = Истина;
	    Сообщить("Не удалось записать историю изменения статуса. " + "Запись заявки отменена. " + ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
КонецПроцедуры

Процедура ЗаписатьИсториюНазначенияИсполнителя(Отказ, МоментИзменения)
	Попытка	
		НоваяЗапись = РегистрыСведений.НазначенияИсполнителей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = МоментИзменения;
		НоваяЗапись.Заявка = Ссылка;
		НоваяЗапись.Исполнитель = Исполнитель;
		НоваяЗапись.Назначил = ТекущийСотрудник;
		НоваяЗапись.Записать();
	Исключение
		Отказ = Истина;
	    Сообщить("Не удалось записать историю назначения исполнителя. " + "Запись заявки отменена. " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры 

Процедура ЗаписатьУведомлениеПоИзменениюСтатуса(Отказ, МоментИзменения)

	ПолучательУведомления = Неопределено;
	ТипУведомления = Перечисления.ТипыУведомлений.ПустаяСсылка();
	ТекстУведомления = "";

	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе И ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения Тогда
		ПолучательУведомления = Заявитель;
		ТипУведомления = Перечисления.ТипыУведомлений.ЗапросУточнения;
	    ТекстУведомления = "Ваша заявка " + Строка(Ссылка) + " требует уточнения.";
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе И ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда
		ТекстУведомления = "По заявке " + Строка(Ссылка) + " требуется выдача или ремонт оборудования.";
		УведомленияЗаписаны = УправлениеУведомлениямиСервер.ЗаписатьУведомленияОтветственнымЗаОборудование(
					Ссылка,
					Перечисления.ТипыУведомлений.ТребуетсяРаботаСОборудованием,
					ТекстУведомления,
					МоментИзменения);

		Если НЕ УведомленияЗаписаны Тогда
			Отказ = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе И ТекущийСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
		ПолучательУведомления = Заявитель;
		ТипУведомления = Перечисления.ТипыУведомлений.РешениеЗаявки;
	    ТекстУведомления = "Ваша заявка " + Строка(Ссылка) + " решена.";
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Решена И ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		ПолучательУведомления = Исполнитель;
		ТипУведомления = Перечисления.ТипыУведомлений.ВозвратВРаботу;
	    ТекстУведомления = "Заявка " + Строка(Ссылка) + " возвращена в работу.";
	КонецЕсли; 
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование И ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		УведомленияОбработаны =УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(
					Ссылка,
					Перечисления.ТипыУведомлений.ТребуетсяРаботаСОборудованием,
					МоментИзменения);

		Если НЕ УведомленияОбработаны Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ПолучательУведомления = Исполнитель;
		ТипУведомления = Перечисления.ТипыУведомлений.РаботаСОборудованиемЗавершена;
		ТекстУведомления = "Работа с оборудованием по заявке " + Строка(Ссылка) + " завершена. Можно продолжить выполнение заявки.";
	КонецЕсли;
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование И ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
		УведомленияОбработаны = УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(
					Ссылка,
					Перечисления.ТипыУведомлений.ТребуетсяРаботаСОборудованием,
					МоментИзменения);

		Если НЕ УведомленияОбработаны Тогда
			Отказ = Истина;
		КонецЕсли;

		Возврат;
	КонецЕсли;

    Если ПолучательУведомления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеЗаписано =
		УправлениеУведомлениямиСервер.ЗаписатьУведомление(
				ПолучательУведомления,
				Ссылка,
				ТипУведомления,
				ТекстУведомления,
				МоментИзменения);

	Если НЕ УведомлениеЗаписано Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьУведомленияРуководителямПоИзменениюСтатуса(Отказ, МоментИзменения)
	ТипУведомления = Перечисления.ТипыУведомлений.ПустаяСсылка();
	ТекстУведомления = "";
	
	Если Не ЗначениеЗаполнено(ПредыдущийСтатус) И ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая Тогда
		ТипУведомления = Перечисления.ТипыУведомлений.ТребуетНазначения;
		ТекстУведомления = "Новая заявка " + Строка(Ссылка) + " ожидает назначения исполнителя.";
		
	ИначеЕсли ПредыдущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе И ТекущийСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
		ТипУведомления = Перечисления.ТипыУведомлений.ТребуетЗакрытия;
		ТекстУведомления = "Заявка " + Строка(Ссылка) + " решена и ожидает закрытия.";
	Иначе
		Возврат;
	КонецЕсли;
	
	УведомленияЗаписаны =
		УправлениеУведомлениямиСервер.ЗаписатьУведомленияРуководителям(
			Ссылка,
			ТипУведомления,
			ТекстУведомления,
			МоментИзменения);

	Если НЕ УведомленияЗаписаны Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗакрытьНеактуальныеУведомленияРуководителей(Отказ, МоментИзменения)
	ТипУведомления = Перечисления.ТипыУведомлений.ПустаяСсылка();
	Если СохраненныеДанныеЗаявки <> Неопределено И НЕ ЗначениеЗаполнено(СохраненныеДанныеЗаявки.Исполнитель) И ЗначениеЗаполнено(Исполнитель) Тогда
		ТипУведомления = Перечисления.ТипыУведомлений.ТребуетНазначения;
	ИначеЕсли ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Новая И ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
		ТипУведомления = Перечисления.ТипыУведомлений.ТребуетНазначения;
	ИначеЕсли ПредыдущийСтатус = Перечисления.СтатусыЗаявок.Решена И (ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта ИЛИ ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе) Тогда
		ТипУведомления = Перечисления.ТипыУведомлений.ТребуетЗакрытия;
	Иначе
		Возврат;
	КонецЕсли;	
	
	УведомленияОбработаны =
		УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(
			Ссылка,
			ТипУведомления,
			МоментИзменения);

	Если НЕ УведомленияОбработаны Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры       

Процедура ПриЗаписи(Отказ)
	МоментИзменения = ТекущаяДатаСеанса();
	Если ПредыдущийСтатус <> ТекущийСтатус Тогда 
		ЗаписатьИсториюИзмененияСтатуса(Отказ, МоментИзменения);
		Если Отказ = Истина Тогда
			Возврат;  
		КонецЕсли;
		
		ЗаписатьУведомлениеПоИзменениюСтатуса(Отказ, МоментИзменения); 
		Если Отказ = Истина Тогда
			Возврат;  
		КонецЕсли;
		
		ЗаписатьУведомленияРуководителямПоИзменениюСтатуса(Отказ, МоментИзменения);

		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СохраненныеДанныеЗаявки <> Неопределено
	И Исполнитель <> СохраненныеДанныеЗаявки.Исполнитель Тогда
		ЗаписатьИсториюНазначенияИсполнителя(Отказ, МоментИзменения);
		Если Отказ = Истина Тогда
			Возврат;  
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СохраненныеДанныеЗаявки.Исполнитель) Тогда
			УведомленияОбработаны =
				УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(
					Ссылка,
					Перечисления.ТипыУведомлений.НазначениеЗаявки,
					МоментИзменения);

			Если НЕ УведомленияОбработаны Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекстУведомления = "Вам назначена заявка " + Строка(Ссылка) + ".";

			УведомлениеЗаписано =
				УправлениеУведомлениямиСервер.ЗаписатьУведомление(
					Исполнитель,
					Ссылка,
					Перечисления.ТипыУведомлений.НазначениеЗаявки,
					ТекстУведомления,
					МоментИзменения);

			Если НЕ УведомлениеЗаписано Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли; 		
	КонецЕсли;
	
    ЗакрытьНеактуальныеУведомленияРуководителей(Отказ, МоментИзменения);

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	НарушенияSLAОбработаны = УправлениеSLAСервер.ОбработатьНарушенияSLA(Ссылка, ДатаРеакции, ДатаРешения, ТекущийСтатус, МоментИзменения);

	Если НЕ НарушенияSLAОбработаны Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
КонецПроцедуры
